In [2]:
import sqlite3
import pandas

sqlite_file = 'lahman2014.sqlite'
conn = sqlite3.connect(sqlite_file)  # connect to database and ingest the tables 

# lets run a query to look at the data
salary_query = "SELECT yearID, sum(salary) as total_payroll FROM Salaries WHERE lgID == 'AL' GROUP BY yearID"

team_salaries = pandas.read_sql(salary_query, conn)
team_salaries.head()

   yearID  total_payroll
0    1985    134401120.0
1    1986    157716444.0
2    1987    136088747.0
3    1988    157049812.0
4    1989    188771688.0

In [6]:
createTable_query = "CREATE TABLE statsTbl AS SELECT \
Salaries.yearID, Teams.teamID, Teams.name, Salaries.salary, Teams.G, Teams.W, Teams.L \
FROM Salaries \
INNER JOIN Teams ON Salaries.yearID=Teams.yearID AND Salaries.teamID=Teams.teamID \
WHERE Salaries.lgID=='AL' ;"

cursor = conn.cursor()
cursor.execute(createTable_query)
conn.commit()

In [7]:
query = "select * from statsTbl;"

result = pandas.read_sql(query, conn)
result.head()

   yearID teamID               name    salary    G   W   L
0    1985    BAL  Baltimore Orioles  625000.0  161  83  78
1    1985    BAL  Baltimore Orioles  480000.0  161  83  78
2    1985    BAL  Baltimore Orioles  437500.0  161  83  78
3    1985    BAL  Baltimore Orioles  512500.0  161  83  78
4    1985    BAL  Baltimore Orioles  375000.0  161  83  78

In [8]:
query = "SELECT * FROM statsTbl WHERE teamID='OAK' AND yearID>=1988 AND yearID<=1989;"

result = pandas.read_sql(query, conn)
result.head()

   yearID teamID               name    salary    G    W   L
0    1988    OAK  Oakland Athletics  495000.0  162  104  58
1    1988    OAK  Oakland Athletics  325000.0  162  104  58
2    1988    OAK  Oakland Athletics  550000.0  162  104  58
3    1988    OAK  Oakland Athletics  650000.0  162  104  58
4    1988    OAK  Oakland Athletics  100000.0  162  104  58

In [9]:
query = "SELECT yearID, max(W) from statsTbl WHERE teamID='OAK';"

result = pandas.read_sql(query, conn)
result.head()

   yearID  max(W)
0    1988     104

In [10]:
query = "SELECT teamID, yearID, SUM(salary) AS TotalSalary  \
FROM statsTbl  \
WHERE yearID='1988' AND teamID='OAK' \
GROUP BY teamID,yearID;"

result = pandas.read_sql(query, conn)
result.head()

  teamID  yearID  TotalSalary
0    OAK    1988    9690000.0